InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СотрудникиВПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиВПомощь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОператора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРуководитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Comment>Трейд Софт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаниеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтслеживаниеИзменений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСправочникРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправочникаДляПодбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодбораОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОтветственныеСотрудники/Forms/ФормаСпискаДерево/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Дерево.Видимость = Ложь;
	
	Если Параметры.Отбор.Свойство("Объект") Тогда
		Объект = Параметры.Отбор.Объект;
	Иначе
		Объект = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДеревоКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоКлиент()
	ОбновитьДерево(); 
	//	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма,"Дерево","*",Ложь); 
	КоличествоОшибок = 0;
	Для Каждого Элемент Из Дерево.ПолучитьЭлементы() Цикл
		Попытка
			Элементы.Дерево.Развернуть(Элемент.ПолучитьИдентификатор(), Истина); 
		Исключение
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры



&НаСервере
Процедура ОбновитьДерево()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	ОтветственныеСотрудники.Пользователь КАК Пользователь,
	                      |	ИСТИНА КАК РуководительГруппы
	                      |ИЗ
	                      |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |ГДЕ
	                      |	ОтветственныеСотрудники.Объект = &Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	СотрудникиВПомощь.Пользователь,
	                      |	ЛОЖЬ
	                      |ИЗ
	                      |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |ГДЕ
	                      |	СотрудникиВПомощь.Объект = &Объект
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТипСотрудника,
	                      |	РуководительГруппы УБЫВ,
	                      |	Пользователь");
	Запрос.УстановитьПараметр("Объект", Объект);
	Результат = Запрос.Выполнить().Выбрать();
	
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	Пока Результат.Следующий() Цикл
		Если Результат.РуководительГруппы Тогда
			Нов = ЭлементыДерева.Добавить();		
			НовРП = Нов.ПолучитьЭлементы();
		Иначе
			Нов = НовРП.Добавить();		
		КонецЕсли;
		Нов.ТипСотрудника = Результат.ТипСотрудника;
		Нов.Пользователь = Результат.Пользователь;
		Нов.РуководительГруппы = Результат.РуководительГруппы;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	Форма = ПолучитьФорму("РегистрСведений.ОтветственныеСотрудники.Форма.ФормаЗаписиДерево");
	
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект") Тогда
			Форма.Объект = Элемент.ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;  
	
	Форма.ОткрытьМодально();
	Элементы.Список.Обновить();
	ОбновитьДеревоКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКопированием(Команда)
	ТекущиеДанные = Неопределено;
	Если Элементы.Список.Видимость Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;		
	ИначеЕсли Элементы.Дерево.Видимость Тогда
		ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;		
	КонецЕсли;
	
	Форма = ПолучитьФорму("РегистрСведений.ОтветственныеСотрудники.Форма.ФормаЗаписиДерево");
	Если ТекущиеДанные <> Неопределено Тогда
		Форма.Объект = ?(ТекущиеДанные.Свойство("Объект"), ТекущиеДанные.Объект, Объект);
		Форма.Пользователь = ТекущиеДанные.Пользователь;
		Форма.ТипСотрудника = ТекущиеДанные.ТипСотрудника;
	КонецЕсли;
	Форма.ОткрытьМодально();
	Элементы.Список.Обновить();
	ОбновитьДеревоКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НазначитьГлавнымГруппы(Команда)
	ТекущиеДанные = Неопределено;
	Если Элементы.Список.Видимость Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;		
	ИначеЕсли Элементы.Дерево.Видимость Тогда
		ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;		
	КонецЕсли;
		
	Если ТекущиеДанные <> Неопределено Тогда
		Если Не ТекущиеДанные.РуководительГруппы Тогда
			НазначитьГлавнымГруппыСервер(?(ТекущиеДанные.Свойство("Объект"), ТекущиеДанные.Объект, Объект), 
					ТекущиеДанные.Пользователь, ТекущиеДанные.ТипСотрудника);
			Элементы.Список.Обновить();
			ОбновитьДеревоКлиент();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НазначитьГлавнымГруппыСервер(ТекОбъект, ТекПользователь, ТекТипСотрудника)
	
	НаборРук = РегистрыСведений.ОтветственныеСотрудники.СоздатьМенеджерЗаписи();
	НаборРук.Объект = ТекОбъект;
	НаборРук.ТипСотрудника = ТекТипСотрудника;
	НаборРук.Прочитать();
	
	НаборПом = РегистрыСведений.СотрудникиВПомощь.СоздатьМенеджерЗаписи();
	НаборПом.Объект = ТекОбъект;
	НаборПом.ТипСотрудника = ТекТипСотрудника;
	НаборПом.Пользователь = ТекПользователь;
	НаборПом.Прочитать();
	Если НаборПом.Выбран() И НаборРук.Выбран() Тогда
	
		НаборПом.Пользователь = НаборРук.Пользователь;
		НаборПом.Записать();
	
	КонецЕсли;
	
	Если НаборРук.Выбран() Тогда
	
		НаборРук.Пользователь = ТекПользователь;
		НаборРук.Записать();
	
	КонецЕсли;
	
	//НаборПом.Пользователь = НаборРук.Пользователь;
	//Попытка
	//	НаборПом.Записать();
	//Исключение
	//КонецПопытки;
	//
	//НаборРук.Пользователь = ТекПользователь;
	//Попытка
	//	НаборРук.Записать();
	//Исключение
	//КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	ТекущиеДанные = Неопределено;
	Если Элементы.Список.Видимость Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;		
	ИначеЕсли Элементы.Дерево.Видимость Тогда
		ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;		
	КонецЕсли;
		
	Если ТекущиеДанные <> Неопределено Тогда
		Форма = ПолучитьФорму("РегистрСведений.ОтветственныеСотрудники.Форма.ФормаЗаписиДерево",, ЭтаФорма);
		
		Форма.Объект = ?(ТекущиеДанные.Свойство("Объект"), ТекущиеДанные.Объект, Объект);
		Форма.Пользователь = ТекущиеДанные.Пользователь;
		Форма.ТипСотрудника = ТекущиеДанные.ТипСотрудника;
		Форма.ИсходныйРуководительГруппы = ТекущиеДанные.РуководительГруппы;
		
		Форма.ИсходныйОбъект = Форма.Объект;
		Форма.ИсходныйПользователь = Форма.Пользователь;
		Форма.ИсходныйТипСотрудника = Форма.ТипСотрудника;
			
		Форма.ОткрытьМодально();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ТекущиеДанные = Неопределено;
	Если Элементы.Список.Видимость Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;		
	ИначеЕсли Элементы.Дерево.Видимость Тогда
		ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;		
	КонецЕсли;
		
	Если ТекущиеДанные <> Неопределено Тогда
		УдалитьСотрудникаСервер(?(ТекущиеДанные.Свойство("Объект"), ТекущиеДанные.Объект, Объект), 
				ТекущиеДанные.Пользователь, ТекущиеДанные.ТипСотрудника, ТекущиеДанные.РуководительГруппы);
		Элементы.Список.Обновить();
		ОбновитьДеревоКлиент();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСотрудникаСервер(ТекОбъект, ТекПользователь, ТекТипСотрудника, Знач ТекРуководительГруппы)
	Если ТекРуководительГруппы Тогда
		//попытаться заменить на другого
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	СотрудникиВПомощь.Пользователь
		                      |ИЗ
		                      |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		                      |ГДЕ
		                      |	СотрудникиВПомощь.Объект = &Объект
		                      |	И СотрудникиВПомощь.ТипСотрудника = &ТипСотрудника");
		Запрос.УстановитьПараметр("Объект", ТекОбъект);
		Запрос.УстановитьПараметр("ТипСотрудника", ТекТипСотрудника);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			НазначитьГлавнымГруппыСервер(ТекОбъект, Результат.Пользователь, ТекТипСотрудника);
			ТекРуководительГруппы = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//выполнить удаление
	Если ТекРуководительГруппы Тогда
		Набор = РегистрыСведений.ОтветственныеСотрудники.СоздатьМенеджерЗаписи();
	Иначе
		Набор = РегистрыСведений.СотрудникиВПомощь.СоздатьМенеджерЗаписи();	
		Набор.Пользователь = ТекПользователь;
	КонецЕсли;	
	Набор.Объект = ТекОбъект;
	Набор.ТипСотрудника = ТекТипСотрудника;
	Набор.Прочитать();
	//Попытка
	//	Набор.Удалить();
	//Исключение
	//КонецПопытки;	
	Если Набор.Выбран() Тогда
	
		Набор.Удалить();
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотра(Команда)
	Элементы.Дерево.Видимость = Не Элементы.Дерево.Видимость;
	Элементы.Список.Видимость = Не Элементы.Список.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Изменить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Изменить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Элементы.Список.Обновить();
	ОбновитьДеревоКлиент();
КонецПроцедуры
